<?php

namespace Database\Seeders\Location;

use App\Models\Location\City;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        City::all()->each(function ($city) {
            $city->clearMediaCollection();
        });

        DB::table('cities')->truncate();

        $cities = [
            [
                'name' => 'حلب',
                'img' => 'aleppo.jpg',
                'description' => 'حلب هي مدينة في سوريا وهي مركز محافظة حلب التي تعد أكبر المحافظات السورية من ناحية تعداد السكان بعدد سكان رسمي يفوق 4.6 مليون كما أنها تعتبر العاصمة الإقتصادية لسوريا. تقع شمال غرب سوريا على بعد 310 كم من دمشق',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'دمشق',
                'img' => 'damascus.jpg',
                'description' => 'مشق، عاصمة الجمهورية العربية السورية، ومركز محافظة دمشق. وهي إحدى أقدم مدن العالم مع تاريخ غير منقطع منذ أحد عشر ألف عام تقريبًا، وأقدم مدينة - عاصمة في العالم. أصبحت عاصمة منطقة سوريا منذ عام 635.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'إدلب',
                'img' => 'idlib.jpg',
                'description' => 'مدينة إدلب هي مركز محافظة إدلب الواقعة في شمال سوريا، يطلق عليها إدلب الخضراء لكثرة أشجار الزيتون فيها. تقع إدلب إلى الجنوب الغربي من مدينة حلب وتبعد عنها 60 كم وعن اللاذقية 132 كم وعن دمشق 330 كم وعن حمص 168 كم وعن حماة 105 كم.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'الحسكة',
                'img' => 'hasakah.jpg',
                'description' => 'لحسكة هيَ مدينة ومركز محافظة تقع في شمال شرق سوريا على نهري الخابور وجقجق. تتميز بخصب أراضيها ووفرة مياهها وجمال طبيعتها وكثرة مواقعها الأثرية، كما شهدت نهضة عمرانية حديثة كبيرة وأقيمت حولها مشاريع زراعية وصناعية عديدة',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'حماة',
                'img' => 'hama.jpg',
                'description' => 'مدينة حماة مدينة سورية تحتل المرتبة الرابعة من حيث السكان بعد دمشق وحلب وحمص، تقع في وسط الجمهورية العربية السورية، وهي مركز محافظة حماة، تقع على نهر العاصي ، وترتفع عن سطح البحر حوالي مائتين وسبعين مترا، وتقع عند خط عرض 35 وخط الطول 62، هواءها معتدل جيد، رطوبته قليلة وتتعاقب عليها الفصول الأربع كبقية البلاد السورية وأجمل هذه الفصول فيها فصل الربيع حيث يعتدل المناخ والهواء وتنتعش النفوس وتزهو المناظر بالزهور والورود وتفترش الخضرة السهول والجبال. ويبلغ عدد سكانها حوالي (854.000) نسمة إحصائيات 2010، وتبعد عن العاصمة دمشق (210 كم) وعن مدينة حلب (135 كم).',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'حمص',
                'img' => 'hims.jpg',
                'description' => 'حمص هي مدينة سوريّة، تعتبر ثالث أكبر مدن البلاد من حيث عدد السكان، بعد دمشق وحلب، تقع على الضفة الشرقية لنهر العاصي، متوسطة البلاد وواصلة المحافظات والمدن الجنوبية بالمحافظات والمدن الساحليّة والشماليّة والشرقية، على بعد حوالي 162 كم من شمال العاصمة دمشق وهي العقدة الأكبر للمواصلات في سوريا بحكم موقعها، وهو ما أكسبها موقعًا تجاريًا فريدًا،',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'دير الزور',
                'img' => 'derAlzoor.jpg',
                'description' => 'دير الزور وتعرف محليًا باسم الدير، مدينة سوريّة تعتبر أكبر مدن الشرق السوري قاطبةً، فضلًا عن كونها مركزًا إداريًا لمحافظة دير الزور.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'درعا',
                'img' => 'daraa.jpg',
                'description' => 'درعا مدينة سورية، تقع في جنوب سوريا بالقرب من الحدود السورية الأردنية. كانت في تاريخها مدينة مهمة في حوران الذي يمتد من جنوب دمشق في سوريا إلى جبال عجلون في الأردن. ويبلغ عدد سكان هذه المحافظة مليون ونصف، وتبلغ نسبة الاغتراب بها إلى 65%. وتبلغ مساحتها أربع آلاف كيلومتر مربع.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'الرقة',
                'img' => 'alraqa.jpg',
                'description' => 'الرقة مدينة في شمال سوريا، عاصمة محافظة الرقة، تقع على الضفة الشرقية لنهر الفرات، على بعد حوالي 160 كم شرق مدينة حلب. منذ أواسط السبعينيات يعتمد اقتصاد الرقة على سد الفرات وعلى الزراعة وعلى الحقول النفطية المجاورة. في الرقة متحف تاريخي صغير يسمى متحف الرقة، وقد كشفت الحفريات فيها عن آثار تعود إلى العصر العباسي.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'ريف دمشق',
                'img' => 'damascusCountryside.jpg',
                'description' => 'تمتد المحافظة لتحيط بمحافظة دمشق العاصمة بشكل شبه دائري مع امتدادات في جميع الاتجاهات مكونة قوس من الخضرة وبساتين الفاكهة ومناخ المحافظة معتدل صيفا وبارد ومنعش في المرتفعات وتتساقط الثلوج على المرتفعات في الشتاء وتتمركز الكثير من الصناعات في محافظة ريف دمشق حيث أن أغلب المصانع ومنذ فترة طويلة يتم إنشاؤها في هذه المحافظة وكذلك الزراعات حيث تمد المدينة بأغلب المنتوجات الزراعية ولها حدود مع لبنان والأردن.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'سويداء',
                'img' => 'sweida.jpg',
                'description' => 'السويداء مدينة في الجمهورية العربية السورية وهي مركز محافظة السويداء، وتقع على بعد 100 كم جنوب مدينة دمشق، وتتربّع فوق قمم سلسلة جبلية بركانية خامدة يطلق عليها جبل العرب، ويتميز الجبل بجمال الطبيعة والمناخ المعتدل البارد صيفاً والبارد جداً في الشتاء وتتساقط الثلوج على أغلب المرتفعات الجبلية، وترتبط المحافظة بشبكة من الطرق الرئيسية التي تصل المدن الرئيسية بالقرى والبلدات. يُشار إلى المدينة من قبل البعض باسم «فنزويلا الصغيرة» بسبب التدفق إلى المدينة من المهاجرين الفنزويليين من أصول سورية من الأثرياء. وسكان المدينة هم بشكل رئيسي من الموحدون الدروز إلى جانب أقلية كبيرة من أتباع الكنيسة الأرثوذكسية الشرقية.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'طرطوس',
                'img' => 'tartous.jpg',
                'description' => 'طرطوس مدينة سورية على ساحل البحر المتوسط وهي أهم ميناء في سورية، وهي مدينة تاريخية فينيقية اكتسبت اسمها من اللاتينية «أنترادوس»، وهي مركز محافظة طرطوس تقع مقابلها جزيرة أرواد وهي جزيرة سورية كانت مملكة بحرية بسطت نفوذها على معظم الساحل السوري البحر الأبيض المتوسط. ',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'القنيطرة',
                'img' => 'quneitra.jpg',
                'description' => 'القنيطرة هي مدينة مغربية، تطل على الساحل الأطلسي، على بعد 40 كم شمال العاصمة الرباط.إحدى أهم مدن المملكة، يسكنها 800 ألف نسمة.',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'name' => 'اللاذقية',
                'img' => 'latakia.jpg',
                'description' => 'محافظة اللاذقية محافظة سورية تقع شمال غرب سوريا تطل على البحر الأبيض المتوسط وفيها ميناء كبير ومعظم أراضيها تغطيها الغابات والبساتين ويبلغ مساحة محافظة اللاذقية 2297 كم ويبلغ عدد قرى محافظة 500 قرية و لها حدود مع تركيا ومع محافظة إدلب و محافظة حماة ومحافظة طرطوس، والمحافظة خليط من عدة أعراق من العرب والتركمان',
                'country_id' => 212,
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ];
        $id = 1;
        foreach ($cities as $city) {
            $city['id'] = $id++;
            $img = storage_path('images/city/' . $city['img']);
            unset($city['img']);
            $cityObject = (new City())->create($city);
            $cityObject->copyMedia($img)->toMediaCollection();
        }
    }
}
